Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC8A.xml
        <register name="UESTA4" offset="0x140" rw="R" size="4" initval="0x00000100" caption="Endpoint Status Register">
          <bitfield name="TXINI" caption="Transmitted IN Data Interrupt" mask="0x1"/>
          <bitfield name="RXOUTI" caption="Received OUT Data Interrupt" mask="0x2"/>
          <bitfield name="RXSTPI" caption="Received SETUP Interrupt" mask="0x4"/>
          <bitfield name="NAKOUTI" caption="NAKed OUT Interrupt" mask="0x8"/>
          <bitfield name="NAKINI" caption="NAKed IN Interrupt" mask="0x10"/>
          <bitfield name="STALLEDI" caption="STALLed Interrupt" mask="0x40"/>
          <bitfield name="DTSEQ" caption="Data Toggle Sequence" mask="0x300"/>
          <bitfield name="RAMACERI" caption="Ram Access Error Interrupt" mask="0x800"/>
          <bitfield name="NBUSYBK" caption="Number Of Busy Banks" mask="0x3000"/>
          <bitfield name="CURRBK" caption="Current Bank" mask="0xC000"/>
          <bitfield name="CTRLDIR" caption="Control Direction" mask="0x20000" values="USBC_UESTA4__CTRLDIR"/>
        </register>
        <register name="UESTA5" offset="0x144" rw="R" size="4" initval="0x00000100" caption="Endpoint Status Register">
          <bitfield name="TXINI" caption="Transmitted IN Data Interrupt" mask="0x1"/>
          <bitfield name="RXOUTI" caption="Received OUT Data Interrupt" mask="0x2"/>
          <bitfield name="RXSTPI" caption="Received SETUP Interrupt" mask="0x4"/>
          <bitfield name="NAKOUTI" caption="NAKed OUT Interrupt" mask="0x8"/>
          <bitfield name="NAKINI" caption="NAKed IN Interrupt" mask="0x10"/>
          <bitfield name="STALLEDI" caption="STALLed Interrupt" mask="0x40"/>
          <bitfield name="DTSEQ" caption="Data Toggle Sequence" mask="0x300"/>
          <bitfield name="RAMACERI" caption="Ram Access Error Interrupt" mask="0x800"/>
          <bitfield name="NBUSYBK" caption="Number Of Busy Banks" mask="0x3000"/>
          <bitfield name="CURRBK" caption="Current Bank" mask="0xC000"/>
          <bitfield name="CTRLDIR" caption="Control Direction" mask="0x20000" values="USBC_UESTA5__CTRLDIR"/>
        </register>
        <register name="UESTA6" offset="0x148" rw="R" size="4" initval="0x00000100" caption="Endpoint Status Register">
          <bitfield name="TXINI" caption="Transmitted IN Data Interrupt" mask="0x1"/>
          <bitfield name="RXOUTI" caption="Received OUT Data Interrupt" mask="0x2"/>
          <bitfield name="RXSTPI" caption="Received SETUP Interrupt" mask="0x4"/>
          <bitfield name="NAKOUTI" caption="NAKed OUT Interrupt" mask="0x8"/>
          <bitfield name="NAKINI" caption="NAKed IN Interrupt" mask="0x10"/>
          <bitfield name="STALLEDI" caption="STALLed Interrupt" mask="0x40"/>
          <bitfield name="DTSEQ" caption="Data Toggle Sequence" mask="0x300"/>
          <bitfield name="RAMACERI" caption="Ram Access Error Interrupt" mask="0x800"/>
          <bitfield name="NBUSYBK" caption="Number Of Busy Banks" mask="0x3000"/>
          <bitfield name="CURRBK" caption="Current Bank" mask="0xC000"/>
          <bitfield name="CTRLDIR" caption="Control Direction" mask="0x20000" values="USBC_UESTA6__CTRLDIR"/>
        </register>
        <register name="UESTA7" offset="0x14c" rw="R" size="4" initval="0x00000100" caption="Endpoint Status Register">
          <bitfield name="TXINI" caption="Transmitted IN Data Interrupt" mask="0x1"/>
          <bitfield name="RXOUTI" caption="Received OUT Data Interrupt" mask="0x2"/>
          <bitfield name="RXSTPI" caption="Received SETUP Interrupt" mask="0x4"/>
          <bitfield name="NAKOUTI" caption="NAKed OUT Interrupt" mask="0x8"/>
          <bitfield name="NAKINI" caption="NAKed IN Interrupt" mask="0x10"/>
          <bitfield name="STALLEDI" caption="STALLed Interrupt" mask="0x40"/>
          <bitfield name="DTSEQ" caption="Data Toggle Sequence" mask="0x300"/>
          <bitfield name="RAMACERI" caption="Ram Access Error Interrupt" mask="0x800"/>
          <bitfield name="NBUSYBK" caption="Number Of Busy Banks" mask="0x3000"/>
          <bitfield name="CURRBK" caption="Current Bank" mask="0xC000"/>
          <bitfield name="CTRLDIR" caption="Control Direction" mask="0x20000" values="USBC_UESTA7__CTRLDIR"/>
        </register>
        <register name="UESTA0CLR" offset="0x160" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Clear Register">
          <bitfield name="TXINIC" caption="TXINI Clear" mask="0x1"/>
          <bitfield name="RXOUTIC" caption="RXOUTI Clear" mask="0x2"/>
          <bitfield name="RXSTPIC" caption="RXSTPI Clear" mask="0x4"/>
          <bitfield name="NAKOUTIC" caption="NAKOUTI Clear" mask="0x8"/>
          <bitfield name="NAKINIC" caption="NAKINI Clear" mask="0x10"/>
          <bitfield name="STALLEDIC" caption="STALLEDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x800"/>
        </register>
        <register name="UESTA1CLR" offset="0x164" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Clear Register">
          <bitfield name="TXINIC" caption="TXINI Clear" mask="0x1"/>
          <bitfield name="RXOUTIC" caption="RXOUTI Clear" mask="0x2"/>
          <bitfield name="RXSTPIC" caption="RXSTPI Clear" mask="0x4"/>
          <bitfield name="NAKOUTIC" caption="NAKOUTI Clear" mask="0x8"/>
          <bitfield name="NAKINIC" caption="NAKINI Clear" mask="0x10"/>
          <bitfield name="STALLEDIC" caption="STALLEDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x800"/>
        </register>
        <register name="UESTA2CLR" offset="0x168" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Clear Register">
          <bitfield name="TXINIC" caption="TXINI Clear" mask="0x1"/>
          <bitfield name="RXOUTIC" caption="RXOUTI Clear" mask="0x2"/>
          <bitfield name="RXSTPIC" caption="RXSTPI Clear" mask="0x4"/>
          <bitfield name="NAKOUTIC" caption="NAKOUTI Clear" mask="0x8"/>
          <bitfield name="NAKINIC" caption="NAKINI Clear" mask="0x10"/>
          <bitfield name="STALLEDIC" caption="STALLEDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x800"/>
        </register>
